Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: །ཁོ་མོས་རྒྱལ་པོ་བཞེངས་སུ་གསོལ།
en: “I requested the king to arise,

source: །དེ་ཡི་འཁོར་དང་བུད་མེད་ཚོགས་ཀྱང་བསླང་།
en: And his court and his wives also got up.

source: །སངས་རྒྱས་འོད་ཡངས་མཐོང་གྱུར་ནས།
en: When they saw the vast light from the Buddha,

source: །ཀུན་ཀྱང་བདེ་བའི་ལུས་སུ་གྱུར།
en: They all experienced physical pleasure. “I proceeded to the presence of the Jina

source: །རྒྱལ་པོ་དེ་དང་ལྷན་ཅིག་ཏུ། །བཞོན་པ་བྱེ་བ་སྲོག་ཆགས་ཁྲག་ཁྲིག་གིས། །ཡོངས་སུ་བསྐོར་ཏེ་དཔུང་བཅས་པ།
en: Together with the king and his armed forces And accompanied by ten million carriages

source: །རྒྱལ་བའི་སྤྱན་སྔར་ཀུན་ཀྱང་དོང་།
en: And many quintillions of beings.

source: །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུར་ཡང་།
en: “For twenty thousand years

source: །ཁོ་མོས་རྒྱལ་བ་དེ་ལ་མཆོད་བཀུར་བྱས།
en: I made offerings to the Jina.

source: །རིན་ཆེན་བདུན་ཡང་ཡོན་དུ་ཕུལ།
en: I presented him with the seven jewels

source: །རྒྱ་མཚོ་ཡོངས་དང་བཅས་པའི་ས་ཡང་གསོལ།
en: And the earth and its oceans.

source: །མདོ་སྡེ་རྒྱ་མཚོ་ཡོན་ཏན་སྤྲིན།
en: “The clouds of the qualities of an ocean of sūtras,

source: །སྨོན་ལམ་མཚོ་ལས་ཡོངས་སུ་བྱུང་བའི་རྒྱན།
en: Which were a display arisen from an ocean of prayers,

source: །ཀུན་ཀྱང་དེ་བཞིན་གཤེགས་ལས་བྱུང་།
en: Had all appeared from the Tathāgata

source: །བསམ་པ་ཇི་བཞིན་འགྲོ་བར་དེ་བཞིན་བསྟན།
en: And were taught to beings according to their dispositions.

source: །མཚན་མོའི་ལྷ་མོ་ཇི་སྙེད་ཅིག །དེ་ཚེ་སྙིང་བརྩེར་ཁོ་མོ་ཕན་བསྟན་པ།
en: “Those night goddesses, wishing to benefit me,

source: །དེ་འདྲར་གྱུར་ཏེ་མྱོས་བསལ་ཞེས།
en: With compassion woke me at that time.

source: །ཁོ་མོ་མོས་པ་ཡོངས་སུ་སྐྱེས་པར་གྱུར།
en: There arose an aspiration in me toward them: ‘May I become like them, awakening the intoxicated.’

source: །ཁོ་མོའི་སྨོན་ལམ་དེ་འདྲའི་སེམས།
en: “That was the prayer that I made in my mind,

source: །ཐོག་མ་བྱང་ཆུབ་མཆོག་ཏུ་སྐྱེས་པར་གྱུར།
en: My first development of the aspiration for the highest enlightenment,

source: །འཁོར་བའི་རྒྱ་མཚོ་གནས་པའི་ཚེ།
en: Which my residing in the ocean of saṃsāra,

source: །སྲིད་པའི་རྒྱ་མཚོས་དེ་ནི་ཞིག་མ་གྱུར།
en: The ocean of existences, has not destroyed. “I had faith in and offered to

source: །སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་རྣམས། །ཁོ་མོས་དད་པ་བསྐྱེད་དེ་མཆོད་པ་བྱས།
en: Ten million trillion buddhas.

source: །འཁོར་བའི་ལྷ་དང་མི་དབུས་སུ།
en: While in the midst of saṃsāra’s devas and humans,

source: །ཡུལ་གྱི་དགའ་དང་བདེ་ལམ་མངོན་པར་སྨོན།
en: I desired the scope of pleasure and bliss.

source: །རྒྱལ་བའི་དང་པོ་དཔལ་གྱི་མཚོ།
en: “The first was Śrīsamudra.

source: །དེ་ཡི་འོག་མ་ཡོན་ཏན་སྒྲོན་མ་སྟེ།
en: After him came Guṇa­pradīpa.

source: །རྒྱལ་བ་གསུམ་པ་རིན་ཆེན་དཔལ།
en: The third was the Jina Ratnaketu.

source: །སངས་རྒྱས་བཞི་པ་ནམ་མཁའི་ཤེས་རབ་བོ།
en: The fourth was the Buddha Gagana­prajña. “The fifth jina was Kusumagarbha.

source: །རྒྱལ་བ་ལྔ་པ་མེ་ཏོག་མཆོག །རྒྱལ་བ་དྲུག་པ་ཆགས་མེད་ཟླ་བའི་བློ།
en: The sixth jina was Asaṅga­mati­candra.

source: །རྒྱལ་བ་བདུན་པ་འོད་རྒྱལ་ཆོས་ཀྱི་ཟླ།
en: The seventh jina was Dharma­candra­prabhu­rāja.

source: །བརྒྱད་པ་ཡེ་ཤེས་དཀྱིལ་འཁོར་སྣང་བའོ། །རིན་ཆེན་འོད་འཕྲོ་རི་སྒྲོན་ཏེ།
en: The eighth was Jñāna­maṇḍala­prabhāsa.

source: །རྒྱལ་བ་དགུ་པ་དེ་ཚེ་བྱུང་བར་གྱུར།
en: “Then came the time of the ninth jina, Racanārci­parvata­pradīpa.

source: །བཅུ་པ་དུས་གསུམ་འོད་དབྱངས་ཏེ།
en: The tenth was Tryadhva­prabha­ghoṣa.

source: །དེ་དག་ཁོ་མོས་དད་པས་མཆོད།
en: With faith, I made offerings to them all. “I made offerings to those ten

source: །བཅུ་པོ་དེ་ལ་ས་སོགས་པ་དག །མི་ཡི་དབང་པོ་དམ་པ་ཀུན་མཆོད་དེ།
en: And all the other lords of humans. But I did not at that time attain

source: །ཚུལ་གྱི་རྒྱ་མཚོ་འདིར་ཞུགས་པའི། །མིག་ནི་དེ་སྲིད་ཡུན་གྱིས་ཐོབ་མ་གྱུར།
en: The vision of entering the ocean of ways.

source: །དེ་འོག་ཞིང་གི་འཚམས་སྦྱོར་བ།
en: “After that there followed the realm

source: །རིན་ཆེན་ཐམས་ཅད་འོད་ཅེས་བྱ་བ་བྱུང་།
en: That was called Sarvaratnābha

source: །བསྐལ་པ་ལྷ་ཡི་དཔལ་ཞེས་བྱ།
en: In the kalpa called Devaśrī

source: །སངས་རྒྱས་ལྔ་བརྒྱ་དེ་ལ་བྱུང་བར་གྱུར།
en: In which five hundred buddhas appeared.

source: །ཐོག་མ་ཟླ་བའི་དཀྱིལ་འཁོར་བྱུང་།
en: “The first was Śaśimaṇḍala.

source: །གཉིས་པ་ཉི་མའི་སྒྲོན་མ་མངོན་པར་སྐྱེས།
en: The second born was Bhāskara­pradīpa.

source: །སྣང་བའི་རྒྱལ་མཚན་སངས་རྒྱས་གསུམ།
en: The third buddha was Jyotidhvaja,

source: །དེ་ཡི་འོག་ཏུ་རིན་ཆེན་རི་བོའོ།
en: And after him there were Maṇisumeru,

source: །མེ་ཏོག་འོད་འཕྲོ་རྒྱ་མཚོ་སྒྲོན།
en: “Kusumārci­sāgara­pradīpa,

source: །མེ་ཡི་དཔལ་དང་ལྷ་ཡི་དཔལ་གྱི་མཆོག །སྣང་བའི་རྒྱལ་པོ་འོད་ཀྱི་དཔལ།
en: Jvalanaśrīśa, Devaśrīgarbha, Avabhāsa­rāja, and Prabha­ketu

source: །བཅུ་པ་ཡེ་ཤེས་ཀུན་སྣང་རྒྱལ་པོ་འོ།
en: The tenth was Samanta­jñāna­prabha­rāja. “I made offerings to those ten

source: །བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །མི་ཡི་དབང་པོ་དེ་དག་ཁོ་མོ་ཡིས།
en: And all the rest of those lords of humans.

source: །ཕུང་པོའི་གནས་ལ་དད་དགའ་ཞིང་།
en: But I delighted in being located in the body.

source: །གནས་མེད་ཆོས་ལ་གནས་ཀྱི་བློ་མཆོད་དོ།
en: I had a mind dwelling in the Dharma that has no location.

source: །དེ་འོག་དེ་ཡི་མཚམས་སྦྱོར་བ།
en: “Following that, there was

source: །འཇིག་རྟེན་ཁམས་བཟང་བྱུང་བར་གྱུར་པ་ནི།
en: The beautiful world realm

source: །པད་མའི་སྒྲོན་མ་སྤྲིན་གྱི་དཔལ།
en: Called Dharma­pradīpa­megha­śrī

source: །དེ་ཚེ་བསྐལ་པ་ཚངས་པའི་འོད་ཅེས་བྱ།
en: In the kalpa called Brahmaprabha.

source: །དེ་ལ་རྒྱལ་བ་ཚད་མེད་དེ།
en: “In that there were countless jinas.

source: །དེ་དག་འཁོར་དང་བཅས་པ་ཁོ་མོས་མཆོད།
en: I made offerings to them and their followers.

source: །རྒྱལ་བ་དེ་དག་ཐམས་ཅད་ལས།
en: From all of those sugatas

source: །རིམ་གྲོ་ཆེན་པོས་ཁོ་མོས་ཆོས་ཀྱང་ཐོས།
en: I heard the Dharma with great respect.

source: །རྒྱལ་བའི་དང་པོ་རིན་ཆེན་རི།
en: “The first jina was Ratnameru.

source: །དེ་ཡི་འོག་མ་ཡོན་ཏན་རྒྱ་མཚོ་སྟེ།
en: After him were Guṇa­samudra

source: །རྒྱལ་བ་ཆོས་དབྱིངས་དབྱངས་ཀྱི་དཔལ།
en: And the Jina Dharma­dhātu­svara­ketu.

source: །ཆོས་རབ་རྒྱ་མཚོ་སྒྲོག་པ་བཞི་པའོ།
en: The fourth was Dharma­samudra­garjana. “Then there were Dharmadhvaja, Dharaṇi­tejas,

source: །ཆོས་ཀྱི་རྒྱལ་མཚན་གཟུངས་ཀྱི་འོད།
en: Dharma­bala­prabha, Gagana­buddhi,

source: །ཆོས་སྟོབས་འོད་དང་ནམ་མཁའི་བློ་གྲོས་ཏེ།
en: And Dharmārci­meru­śikha­rābha,

source: །ཆོས་འོད་རི་བོས་སྤོ་མཐོན་དང་། །དེ་དག་ཐ་མའི་མཚན་ནི་སྤྲིན་དཔལ་ལོ།
en: And after them was Meghaśrī. “I made offerings to those ten

source: །བཅུ་པོ་དེ་ལ་སོགས་པ་དག །མི་ཡི་དམ་པ་དེ་དག་ཀུན་མཆོད་དེ།
en: And all the rest of those lords of humans. But I did not understand the true nature

source: །རྒྱལ་བའི་རྒྱ་མཚོ་འདིར་ཞུགས་པའི། །ཆོས་ཉིད་དེ་ནི་དག་མ་གྱུར།
en: By which one enters the ocean of jinas.

source: །དེ་ཡི་འོག་ཏུ་དེ་བཞིན་གཤེགས།
en: “After that came the Sugata

source: །ཉི་མའི་སྒྲོན་མ་དཔལ་གྱི་དཔལ་ཞེས་བྱ།
en: Sūrya­pradīpa­ketu­śrī

source: །ཞིང་ནི་སངས་རྒྱས་ཡོད་པ་སྟེ།
en: In a realm called Buddhamati,

source: །དེ་ལ་བསྐལ་པ་ཟླ་བའི་དཔལ་བྱུང་ངོ་།
en: In a kalpa called Somaśrī. “I made offerings to all eight hundred million

source: །དེ་ལ་སྟོབས་བཅུ་བྱུང་བ་ནི།
en: Of those with the ten strengths who were present there,

source: །བྱེ་བ་བརྒྱད་ཅུ་ཡོངས་སུ་ཚང་བ་སྟེ། །དེ་དག་ཀུན་ལའང་མཆོད་པའི་སྒོ།
en: With a variety of limitless, vast,

source: །རྒྱ་ཆེ་མཐའ་ཡས་ཡིད་འོང་དུ་མ་བྱས།
en: Numerous beautiful offerings.

source: །ཐོག་མར་བྱུང་བ་དྲི་ཟའི་རྒྱལ།
en: “The first after him was Gandharva­rāja,

source: །དེ་ཡི་འོག་ཏུ་སངས་རྒྱས་ཤིང་རྒྱལ་ཏེ།
en: Second was the Buddha Druma­rāja,

source: །རྒྱལ་བ་གསུམ་པ་ཡོན་ཏན་རི།
en: The third jina was Guṇa­sumeru

source: །དེ་ཡི་འོག་ཏུ་རིན་ཆེན་སྤྱན་གཤེགས་སོ།
en: And after him were Ratnanetra

source: །རྣམ་པར་སྣང་མཛད་འོད་ཀྱི་རྒྱན།
en: “Vairocana­prabha­vyūha,

source: །ཆོས་ཀྱི་རྒྱ་མཚོ་སངས་རྒྱས་གཟི་བརྗིད་དཔལ།
en: Dharma­samudra , the Buddha Tejaśrī,

source: །འཇིག་རྟེན་དབང་པོ་འོད་བཟང་དཔལ།
en: Lokendra­teja­śrī­bhadra,

source: །ཀུན་གྱི་ཐ་མ་ཆོས་འོད་རྒྱལ་པོའོ།
en: And after them Sarva­dharma­prabha­rāja.

source: །བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །བདེ་གཤེགས་དེ་དག་ཐམས་ཅད་མཆོད་བྱས་ཀྱང་། །ཆོས་ཀྱི་རྒྱ་མཚོར་འཇུག་པ་ཡི།
en: “I made offerings to those ten And all the rest of those sugatas.

source: །ཡེ་ཤེས་ཁོ་མོས་ཐོབ་པར་མ་གྱུར་ཏོ།
en: But I did not attain the knowledge That comprehended that ocean of Dharma.

source: །དེ་ཡི་འོག་ཏུ་ཞིང་དག་པ།
en: “After that, there was a perfectly pure realm

source: །རྡོ་རྗེའི་རང་བཞིན་མི་ཕྱེད་གཟི་བརྗིད་བརྟན།
en: Called Vajra­māṇyabhedyadṛḍha­tejas,

source: །ཀུན་ཏུ་འོད་སྤྲིན་མིང་ལྡན་བྱུང་།
en: In which there were constant clouds of light

source: །རྒྱན་གཅིག་ཀུན་ནས་མཛེས་པར་གནས་པའོ།
en: And the presence of numerous beautiful displays.

source: །དེ་ལ་སེམས་ཅན་དག་པ་མང་།
en: “Within it there were many pure beings

source: །ཉོན་མོངས་དྲི་མས་ཉོན་མོངས་ཤིན་ཏུ་ཉུང་།
en: With few afflictions from the stains of kleśas.

source: །བསྐལ་པ་རབ་ཞི་བློ་གྲོས་འོད།
en: The kalpa was called Praśānta­mati­tejas

source: །སངས་རྒྱས་སྟོང་རྣམས་བྱུང་བས་རྣམ་པར་བརྒྱན།
en: With the display of the appearance of a thousand buddhas. “The first jina was Vajranābhi,

source: །རྒྱལ་བའི་དང་པོ་རྡོ་རྗེ་གཙུག །གཉིས་པ་ཆགས་མེད་སྟོབས་མངའི་མཚན་ལྡན་པ།
en: The second was Asaṅga­bala­dhārin, Then there were the jinas Dharma­dhātu­pratibhāsa And Sarva­diśa­pradīpa­prabha­rāja.

source: །རྒྱལ་བ་ཆོས་ཉིད་གཟུགས་བརྙན་དང་། །ཕྱོགས་རྣམས་ཀུན་ཏུ་སྒྲོན་མ་གསལ་བའི་བདག །རྒྱལ་བ་ལྔ་པ་ཐུགས་རྗེའི་འོད།
en: “The fifth jina was Karuṇatejas,

source: །རྒྱལ་བ་དྲུག་པ་བརྟུལ་ཞུགས་རྒྱ་མཚོའོ།
en: The sixth jina was Vratasamudra,

source: །བདེ་གཤེགས་བཟོད་འཁོར་སྒྲོན་མ་དང་། །བརྒྱད་པ་ཆོས་ཀྱི་དཀྱིལ་འཁོར་སྣང་བ་སྟེ།
en: Then there was the Sugata Kṣānti­maṇḍala­pradīpa, And the eighth was Dharma­maṇḍala­prabhāsa;

source: །སྣང་བ་རྒྱ་མཚོས་བརྒྱན་པ་དང་། །དེ་དག་ཐ་མ་ཞི་བའི་རྒྱལ་པོའོ།
en: “Then there was Avabhāsa­sāgara­vyūha,

source: །བཅུ་པོ་དེ་ལ་སོགས་པ་དག །མི་ཡི་དམ་པ་དེ་ཀུན་ཁོ་མོས་མཆོད།
en: And after them was Praśānta­prabha­rāja. I made offerings to those ten And all the rest of those lords of humans. “But I did not realize this nature of phenomena,

source: །ཆོས་ཉིད་ནམ་མཁའ་མཉམ་པ་འདི། །རང་བཞིན་ཡོངས་སུ་ཀུན་ནས་དག་པ་སྟེ།
en: The pure nature that is the same as space,

source: །དེ་ལ་གནས་ཤིང་ཞིང་གི་རྣམས།
en: In which one should remain while practicing In the entire vast extent of realms.

source: །འབྱམ་ཀླས་ཀུན་ཏུ་སྤྱོད་སྤྱད་མ་དག་གོ །དེ་ཡི་འོག་ཏུ་མདངས་དགའ་བའི།
en: “After that, there was the beautiful realm

source: །ཞིང་གི་སྤོས་སྒྲོན་སྤྲིན་གྱི་དཔལ་ཞེས་བྱ།
en: Called Gandha­pradīpa­megha­śrī,

source: །ཀུན་ནས་ཉོན་མོངས་ཡོངས་སུ་དག །དེ་ཡི་བསྐལ་པ་ལེགས་པར་བྱུང་ཞེས་བྱ།
en: Completely purified of all the kleśas, In the kalpa that was called Susaṃbhava.

source: །རྒྱལ་བ་བྱེ་བ་དེ་ཚེ་བྱུང་།
en: “During that time there appeared ten million jinas

source: །དེ་དག་ཀུན་གྱི་དེ་ཚེའི་བསྐལ་པ་བརྒྱན།
en: Who were all arrayed throughout that kalpa.

source: །མགོན་པོ་དེ་དག་ཆོས་གསུང་བ།
en: Those guides taught the Dharma,

source: །ཁོ་མོས་དྲན་པའི་སྟོབས་ཀྱིས་ཡོངས་སུ་བཟུང་།
en: And I retained it through the power of memory.

source: །རྒྱལ་བའི་དང་པོ་གྲགས་ཡངས་ཏེ།
en: “The first jina was Vipulakīrti,

source: །ཆོས་ཀྱི་རྒྱ་མཚོ་ཤུགས་དྲག་དཔལ་གྱི་རྒྱལ།
en: Then there were Dharma­samudra­vega­śrī­rāja,

source: །ཆོས་དབང་རྒྱལ་པོ་ཡོན་ཏན་སྤྲིན།
en: Dharmendrarāja, Guṇa­ghoṣa,

source: །ཆོས་ཀྱི་དཔལ་དང་ལྷ་ཡི་ཅོད་པན་ནོ།
en: Dharmaśrī, and Devamakuṭa;

source: །ཡེ་ཤེས་འོད་འཕྲོ་གཟི་བརྗིད་དཔལ།
en: “Jñānārci­teja­śrī was the seventh

source: །རྐང་གཉིས་དམ་པ་བདུན་པ་དེ་ཡིན་ནོ།
en: Of those lords of two-legged beings.

source: །རྒྱལ་བ་བརྒྱད་པ་ནམ་མཁའི་དབྱིངས།
en: The eighth jina was Gagana­ghoṣa,

source: །དགུ་པ་ཀུན་ཏུ་འབྱུང་བའི་སྒྲོན་མ་སྟེ།
en: And the ninth was Samanta­saṃbhava­pradīpa. “The buddha that came after them

source: །དེ་དག་ཐ་མའི་སངས་རྒྱས་ནི། །མཛོད་སྤུའི་དཔལ་གྱི་འོད་ཀྱི་བློ་གྲོས་ཏེ།
en: Was Ūrṇa­śrī­prabhāsa­mati.

source: །རྒྱལ་བ་མི་མཆོག་དེ་དག་ལ།
en: I made offerings to all those lords of humans,

source: །མཆོད་པ་བྱས་ནས་ཆགས་མེད་དེ་མ་སྦྱངས།
en: But I did not purify the path free of attachment.

source: །དེ་ཡི་འོག་མ་རྒྱན་རབ་ཅན།
en: “After that there was the well-arranged world realm Called Ratna­dhvajāgra­mati, Which was an excellent display

source: །རིན་ཆེན་སྣ་ཚོགས་ཀུན་ཏུ་གནས་པ་སྟེ།
en: Formed from all kinds of jewels.

source: །རིན་ཆེན་རྒྱལ་མཚན་བློ་གྲོས་མཆོག །དེ་ཚེའི་བསྐལ་པ་སྙིང་པོའི་ཚོགས།
en: “During that kalpa, called Sārocaya,

source: །དེ་ལ་སངས་རྒྱས་བརྒྱ་ཕྲག་ལྔ་བྱུང་སྟེ།
en: There appeared five hundred buddhas. I made offerings to all those self-arisen ones,

source: །རྣམ་ཐར་ཆགས་མེད་འདི་འདོད་ཅིང་། །རང་བྱུང་དེ་དག་ཐམས་ཅད་ཁོ་མོས་མཆོད།
en: Wishing for this liberation free of attachment.

source: ཐོག་མའི་མཚན་ནི་ཡོན་ཏན་འཁོར།
en: “The first was named Guṇa­maṇḍala,

source: །ཞི་བའི་དབྱངས་དང་རྒྱ་མཚོ་ཕུན་སུམ་ཚོགས།
en: Then there were Śānta­nirghoṣa, Sāgara­śrī, Āditya­tejas, Śrīrāja, Lakṣaṇa­meru, Megharutaghoṣa, “Dharmendrarāja, Guṇa­rāja

source: །ཉི་མའི་གཟི་བརྗིད་དཔལ་གྱི་བདག །མཚན་གྱི་སྤྲིན་སྒྲ་དབྱངས་ཤེས་བྱ་བ་དང་། །ཆོས་དབྱངས་རྒྱལ་པོ་ཡོན་ཏན་བདག །བསོད་ནམས་རི་རབ་ཞི་བའི་འོད་ཀྱི་རྒྱལ།
en: Puṇya­sumeru, and Śānta­prabha­rāja.

source: །བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །རྒྱལ་བ་དེ་དག་ཀུན་ཀྱང་ཁོ་མོས་མཆོད།
en: I made offerings to those ten And all the rest of those jinas. “All the jinas have followed

source: །རྒྱལ་བའི་ལམ་ནི་དེར་སྦྱངས་ཏེ། །དེ་ལ་རྒྱལ་བ་ཀུན་ཀྱང་ཡང་དག་གཞོལ།
en: The purifying path of the jinas.

source: །འོན་ཀྱང་ད་དུང་རྒྱལ་བ་ཡི།
en: However, I had still not attained

source: །ཚུལ་འདིར་འཇུག་པའི་བཟོད་པ་མ་ཐོབ་བོ།
en: The patience for entering this way of the jinas.

source: །དེ་འོག་ཡིད་འོང་འོད་ལྡན་པ།
en: “After that there was a completely pure

source: །ཡོངས་སུ་དག་པའི་འཇིག་རྟེན་ཁམས་བྱུང་སྟེ།
en: World realm of very beautiful lights

source: །ཞིང་དབྱངས་ཕྲེང་བའི་བློ་གྲོས་ཅན།
en: Called Śānta­nirghoṣa­hāra­mati,

source: །སེམས་ཅན་ཉོན་མོངས་ཉུང་བའི་གནས་ཡིན་ནོ།
en: Where dwelled beings with few kleśas.

source: །བསྐལ་པ་བདེ་ཞིང་མངོན་དགའ་སྟེ།
en: “In that kalpa called Sukhābhirati

source: །དེ་ལ་སངས་རྒྱས་བྱེ་བ་བརྒྱད་ཅུ་བྱུང་།
en: There appeared eight hundred million buddhas.

source: །མི་མཆོག་དེ་ཀུན་ཁོ་མོས་མཆོད།
en: I made offerings to all those lords of humans,

source: །རྒྱལ་བ་མཆོག་གི་ལམ་ཡང་རྣམ་པར་སྦྱངས།
en: Purifying the path of the supreme jinas.

source: །རྒྱལ་བའི་དང་པོ་མེ་ཏོག་བརྩེགས།
en: “The first jina was Kusumarāśi, Then there were Sāgara­garbha, Saṃbhavagiri,

source: །རྒྱ་མཚོའ་སྙིང་པོ་ཡང་དག་འབྱུང་བའི་མཆོག །ལྷ་དབང་གཙུག་ཕུད་རིན་ཆེན་གཙོ།
en: Devendracūḍa, Maṇi­garbha, Kāñcanaparvata, Ratnaraśi,

source: །གསེར་གྱི་རི་བོ་རིན་ཆེན་བརྩེགས་པ་དང་། །ཆོས་ཀྱི་རྒྱལ་མཚན་ནོར་གྱི་དཔལ།
en: “Dharmadhvaja, and Vacanaśrī,

source: །དེ་དག་ཀུན་གྱི་ཐ་མ་ཡེ་ཤེས་བློ།
en: And after them there was Jñānamati.

source: །བཅུ་པོ་དེ་ལ་སོགས་པ་དག །ལྷ་དང་མི་གཙོ་དེ་དག་ཁོ་མོས་མཆོད།
en: I made offerings to those ten And all the rest of those lords of devas and humans.

source: །དེ་འོག་མཚམས་སྦྱོར་ཞིང་བྱུང་བ།
en: “After that, there was the realm

source: །སྤྲུལ་པ་བཟང་པོའི་རྒྱལ་མཚན་སྒྲོན་མ་སྟེ།
en: Called Sunirmita­dhvaja­pradīpa,

source: །བསྐལ་པ་སྟོང་གི་དཔལ་ཞེས་བྱ།
en: In the kalpa called Sahasraśrī,

source: །དེ་ལ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དྲུག །ཞི་བའི་རྒྱལ་མཚན་ཞི་གནས་དཔལ།
en: In which there were six quintillion buddhas. “There were Śānta­dhvaja, Śamathaketu,

source: །ཞི་བའི་སྒྲོན་མ་སྤྲིན་གྱི་རྒྱལ་པོའི་དཔལ།
en: Śānta­pradīpa­megha­śrī­rāja, Avabhāsa­yanta­prabha­rājā, Meghavilambita, Suryatejas,

source: །སྣང་བའི་འོད་ཀྱི་རྒྱལ་པོ་དང་། །རྣམ་པར་སྤྲིན་མཆེད་ཉི་མའི་གཟ་བརྗིད་དང་། །ཆོས་ཀྱི་སྒྲོན་མ་དཔལ་གྱི་རི།
en: “Dharma­pradīpa­śrī, Mervarciśrī,

source: །འོད་འཕྲོའི་དཔལ་དང་ལྷ་ཡི་སྙིང་པོའི་དཔལ།
en: And also Deva­śrī­garbha.

source: །དེ་དག་ཐ་མར་བྱུང་བ་ནི།
en: After all those there appeared

source: །སེང་གེའི་སྒྲ་སྒྲོགས་མཁས་པ་སྒྲོན་མའོ།
en: Siṃha­vinardita Vidu­pradīpa.

source: བཅུ་པོ་དེ་ལ་སྩོགས་པ་དག །བདེ་གཤེགས་ཟླ་བ་དེ་དག་ཁོ་མོས་མཆོད།
en: “I made offerings to those ten And all the rest of those sugata moons,

source: །འོན་ཀྱང་ཚུལ་མཚོ་འདིར་འཇུག་པའི། །བཟོད་པ་ཁོ་མོས་ཐོབ་པར་མ་གྱུར་ཏོ།
en: But I did not attain the patience For entering this ocean of ways.

source: །དེ་འོག་འཚམས་སྦྱོར་ཞིང་བྱུང་བ།
en: “Following that there was the realm

source: །ཀུན་ཏུ་སྣང་བའི་དཔལ་ཞེས་བྱ་བ་སྟེ།
en: Called Samantābhaśrī,

source: །བསྐལ་པ་གནས་མེད་རྣམ་པར་བརྒྱན།
en: During the kalpa called Anālayavyūha,

source: །དེ་ལ་སངས་རྒྱས་བྱེ་བ་སུམ་ཅུ་དྲུག །དང་པོ་ཡོན་ཏན་ཀུན་ཏུ་སྤྲིན།
en: In which there were three hundred and sixty million buddhas. “The first was Samanta­guṇa­megha.

source: །དེ་ཡི་འོག་མ་སངས་རྒྱས་ནམ་མཁའི་ཐུགས།
en: Then there were the Buddha Gagana­citta,

source: །སངས་རྒྱས་ལེགས་བྱུང་རྣམ་བརྒྱན་དང་། །རྒྱ་མཚོ་ཆོས་ཀྱི་སྤྲིན་སྒྲ་སྒྲོགས་པའི་དབྱངས།
en: The Buddha Susaṃbhava­vyūha, Garjita­dharma­sāgara­nirghoṣa,

source: །རྒྱལ་བ་ཆོས་དབྱིངས་གསུང་དབྱངས་དང་། །སྤྲུལ་པའི་སྤྲིན་སྒྲ་སྙན་པའི་དཔལ་མངའ་དང་། །སངས་རྒྱས་ཕྱོགས་ཀུན་གཟི་བརྗིད་དང་། །ཆོས་ཀྱི་རྒྱ་མཚོ་ཡོངས་བྱུང་སྒྲ་དབྱངས་དང་། །ཡོན་ཏན་རྒྱ་མཚོ་དཔལ་གྱི་སྒྲོན།
en: “The Jina Dharma­dhātu­svara­ghoṣa, Nirmita­megha­susvara­śrī, The Buddha Samanta­diśa­tejas, And Dharma­samudra­saṃbhava­ruta,

source: །རྒྱལ་བའི་ཉི་མ་དགུ་པ་བྱུང་བར་གྱུར།
en: “Then there was the ninth of the jina suns, Guṇa­sāgara­śrī­pradīpa.

source: །དེ་དག་ཀུན་གྱི་ཐ་མ་སྟེ།
en: Following those there came

source: །རིན་ཆེན་དཔལ་སྒྲོན་ཡོན་ཏན་དཔལ་མཆོད་དོ།
en: Ratna­śrī­pradīpa­guṇa­ketu.

source: །རིན་ཆེན་དཔལ་སྒྲོན་ཡོན་ཏན་དཔལ།
en: “When Ratna­śrī­pradīpa­guṇa­ketu,

source: །རྐང་གཉིས་དམ་པ་བྱུང་བར་གྱུར་པའི་ཚེ།
en: The lord of two-legged beings, set forth,

source: །ཁོ་མོ་ལྷ་མོ་ཟླ་བཞིན་ཏེ།
en: I was the goddess Śaśivakra,

source: །མི་ཡི་དམ་པ་བྱུང་ཚེ་མཆོད་པ་བྱས།
en: And I made offerings to the lord of humans as he set forth.

source: །རྒྱལ་བ་དེས་ནི་ཁོ་མོ་ལ།
en: “That jina proclaimed to me Sūtras that were displays without location,

source: །མདོ་སྡེ་སྨོན་ལམ་རྒྱ་མཚོ་འབྱུང་བའི་རྒྱན། །གནས་མེད་རྒྱན་ཀྱང་རབ་ཏུ་བཤད།
en: Displays that arose from an ocean of prayers,

source: །ཐོས་ནས་ཁོ་མོས་དྲན་པའི་སྟོབས་ཀྱིས་བཟུང་།
en: Which I heard and retained through the power of memory.

source: །ཁོ་མོས་མིག་ཡངས་དེར་ཐོབ་སྟེ།
en: “I attained at that time vast vision,

source: །ཏིངའཛིན་ཞི་དང་གཟུངས་ཀྱི་སྟོབས་ཀྱང་ཐོབ།
en: Samādhis, and the power of retention.

source: །སྐད་ཅིག་རེ་རེ་ཞིང་བརྒྱུད་པའི། །རྒྱལ་བ་རྒྱ་མཚོ་མང་པོའང་ཁོ་མོས་མཐོང་།
en: In each instant I saw oceans of jinas And a succession of realms. “There arose in me the essence of compassion,

source: །བྱམས་ཚུལ་ཀུན་ཏུ་སྣང་བའི་སྤྲིན།
en: The completely illuminating clouds of the way of kindness,

source: །བྱང་ཆུབ་སེམས་རབ་མཁའ་དང་མཉམ་པ་སྟེ། །སྙིང་རྗེའི་སྙིང་པོས་བརྒྱན་པ་ཡང་།
en: The aspiration to enlightenment, as vast as space,

source: །སངས་རྒྱས་སྟོབས་ཀྱི་ཚུལ་དུ་ཡངས་པར་སྐྱེས།
en: And the vast beauty of the immeasurable buddha strengths. “I saw beings who were in a state of delusion,

source: །འགྲོ་བ་ཕྱིན་ཅི་ལོག་གྱུར་ཏེ། །རྟག་དང་བདེ་དང་གཙང་དང་བདག་ཞེན་པ།
en: Attached to permanence, happiness, purity, and self,

source: །གཏི་མུག་མདོངས་གྱུར་མ་རིག་བསྒྲིབས།
en: Blinded by stupidity, obscured by ignorance,

source: །ཉོན་མོངས་འཁྲུགས་ཤིང་ལོག་པར་འདུ་ཤེས་པ།
en: Disturbed by the kleśas, and having misperceptions.

source: །ལྟ་བའི་རྣམ་པར་སྟུག་ལ་སྤྱོད།
en: “They performed actions in a thicket of wrong views,

source: །ལམ་གྱི་འགྲོ་རྒྱུད་ཉམ་ངར་སྲེད་དབང་གྱུར།
en: Following frightening paths under the power of craving.

source: །རྣམ་པ་སྣ་ཚོགས་བྱེ་བྲག་ཏུ།
en: Many various forms appearing

source: །ལས་ཀྱིས་རྣམ་པར་བྲིས་པས་ཀུན་བྱུང་བ།
en: Were painted by karma.

source: །འགྲོ་རྒྱུད་ཀུན་གྱི་ཤི་འཕོའི་སྒོར།
en: “Those who appeared through being born

source: །སྐྱེ་བར་འགྱུར་བས་ཀུན་ཏུ་སྐྱེར་འགྱུར་ཅིང་།
en: Through the gateways to rebirth in all existences

source: །སྐྱེ་དང་རྒ་ཤི་གནོད་པ་རྣམས། །ལུས་དང་སེམས་ཀྱི་ཉམས་སུ་མྱོང་གྱུར་པ།
en: Had bodies and minds that experienced The torments of birth, aging, and death.

source: །མཐོང་ནས་དེ་དག་ཕན་བདེའི་ཕྱིར།
en: “Seeing that, in order to bring them benefit and happiness I developed the supreme motivation

source: །ཞིང་རྣམས་འབྱམ་ཀླས་ཐམས་ཅད་ཀྱི། །སྟོབས་བཅུ་གང་ལས་བྱུང་བ་ཡི།
en: Wherever those with the ten strengths appeared,

source: །བླ་ན་མེད་པའི་སེམས་ཀྱང་ཁོ་མོས་བསྐྱེད།
en: Anywhere throughout the vast extent of realms.

source: །དེ་ལས་སྨོན་ལམ་སྤྲིན་བྱུང་བ།
en: “From that arose clouds of prayers,

source: །འགྲོ་བ་ཀུན་ལ་བདེ་བར་གཞོལ་བའི་མཆོག །ཚོགས་རྣམས་འབྱུང་བ་མཐའ་ཡས་དང་། །ལམ་ཚུལ་རྒྱ་མཚོ་རྟོགས་པའང་དེ་ནས་བྱུང་།
en: Perfect dedication to the happiness of beings, The arising of limitless accumulations, And the understanding of the ways of an ocean of paths.

source: །འཇུག་པའི་སྤྲིན་ཡངས་ཐོབ་གྱུར་པ།
en: “I obtained vast clouds of practices,

source: །ལམ་ཆུད་ཀུན་ཏུ་སྒོ་གསལ་ཤུགས་ལྡན་ཏེ།
en: The power of clear gateways to all paths,

source: །ཕ་རོལ་ཕྱིན་གྱི་སྤྲིན་ཡངས་པའང་།
en: Vast clouds of the perfections,

source: །ཆོས་དབྱིངས་འབྱམ་ཀླས་ཀུན་ཏུ་རྣམ་པར་འབྱེད།
en: And the opening of the entire extent of the realm of Dharma.

source: །ས་གནོན་ཤུགས་དྲག་ཡངས་ལྡན་དང་། །དུས་གསུམ་རྒྱ་མཚོའི་ཚུལ་གྱི་ས་རྣམས་ལ།
en: “With the vast power to ascend the bhūmis,

source: །ཆགས་པ་མེད་པར་སྤྱོད་པར་གྱུར།
en: Practicing without attachment on the bhūmis, In the ways of the ocean of the three times,

source: །སྐད་ཅིག་གཅིག་གིས་རྒྱལ་བ་ཀུན་དྲུང་འགྲོ།
en: In each instant I came into the presence of all jinas.

source: །གཞན་ཡང་རྒྱལ་སྲས་ཁོ་མོས་ནི།
en: “What is more, I also mastered

source: །སྤྱོད་པ་ཀུན་ཏུ་བཟང་པོ་ཡོངས་སུ་ནོན།
en: The completely good jinaputra conduct, And I realized the ways of the ocean

source: །ཆོས་དབྱིངས་བྱེ་བྲག་བཅུ་རྣམས་ཀྱི། རྒྱ་མཚོའི་ཚུལ་ལའང་ཁོ་མོ་རྟོགས་པར་འཇུག །རིགས་ཀྱི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས།
en: Of the ten aspects of the realm of the Dharma.

source: དེའི་ཚེ་དེའི་དུས་ན། རྒྱལ་པོ་འཁོར་ལོས་སྒྱུར་བ། སངས་རྒྱས་ཀྱི་རིགས་ཀྱི་རྒྱུན་མི་གཅོད་པ་ལ་ཞུགས་པ། མིའི་བདག་པོ་ཞེས་བྱ་བ་བྱུང་བ། དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ནི།
en: “Noble one, do you think that the cakravartin king, that sovereign, who at that time, in that time, was established in the unbroken lineage of the family of the buddhas is anyone else?

source: རིགས་ཀྱི་བུ་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Noble one, do not see him in that way.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི། དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་མིའི་བདག་པོ་ཞེས་བྱ་བ་འཁོར་ལོས་སྒྱུར་བ་སངས་རྒྱས་ཀྱི་རིགས་རྒྱུན་མི་གཅོད་པ་ལ་ཞུགས་པའོ།
en: Mañjuśrī Kumāra­bhūta was at that time, in that time, that king, that sovereign, who was the cakravartin, established in the unbroken lineage of the family of the buddhas.

source: །ཁོ་མོ་སད་པར་བྱེད་པའི་མཚན་མོའི་ལྷ་མོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོས་སྤྲུལ་པའོ།
en: The night goddess who awoke me was an emanation of the bodhisattva Samanta­bhadra.

source: དེའི་ཚེ་དེའི་དུས་ན་འཁོར་ལོས་སྒྱུར་བའི་བཙུན་མོ་བུད་མེད་རིན་པོ་ཆེ་བཟང་པོའི་བློ་གྲོས་མ་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་ནི་དེ་ལྟར་མྱི་བལྟ་སྟེ།
en: If you think that Bhadramati, the precious woman who was the queen of the cakravartin in that time, at that time, was anyone else, do not see her in that way.

source: ཁོ་མོ་ནི་དེའི་ཚེ་དེའི་དུས་ན། འཁོར་ལོས་སྒྱུར་བའི་བཙུན་མོ་བུད་མེད་རིན་པོ་ཆེ་བཟང་པོའི་བློ་གྲོས་མ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: At that time, in that time, I was Bhadramati, the precious woman who was the queen of the cakravartin.

source: ཁོ་མོ་མཚན་མོའི་ལྷ་མོ་དེས་སད་པར་བྱས་ནས། སངས་རྒྱས་བལྟ་བ་ལ་ཡང་དག་པར་བསྐུལ་ཏོ།
en: I was awoken by that night goddess and inspired by her to go see the Buddha.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་དེ་སྲིད་ཅིག་ནས་བསྐྱེད་དེ།
en: “Noble one, I developed in that one existence the aspiration for the highest, complete enlightenment.

source: དེ་ལྟར་ཁོ་མོ་སེམས་བསྐྱེད་པ་དེའི་མཐུས། བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་ནམ་ཡང་ངན་སོང་ལོག་པར་ལྟུང་བར་མ་སྐྱེས་ཏེ། རྟག་ཏུ་རྒྱུན་མ་འཆད་པར་ལྷ་དང་མིའི་འགྲོ་བའི་རྒྱུད་ལ་རྟེན་ཅིང་། ཐམས་ཅད་དུའང་དེ་བཞིན་གཤེགས་པ་བལྟ་བ་དང་ལྡན་པར་གྱུར་ཏོ།
en: In that way, through the power of that development of aspiration, I have, throughout kalpas as numerous as the atoms in a buddha realm, never fallen into rebirth in the lower realms but have always continuously depended on existence as a human or deva, and in all those existences I have seen tathāgatas.
